import functions


topics = {
    "info": (
        "бути",
        "наявність",
        "інформація",
        "детальний",
        "опис",
        "характеристика",
        "рекомендація",
        "параметр",
        "асортимент",
    ),
    "purchase": (
        "купити",
        "оформити",
        "покупка",
        "кошик",
        "придбати",
    ),
    "status": (
        "статус",
        "доставка",
        "прибуття",
        "очікування",
        "відправлення",
    ),
    "add": (
        "база",
        "додати",
        "новий",
        "поповнення",
        "оновлення",
    )
}


question_check = {
    "info": "Ви хочете отримати інформацію про наш асортимент?",
    "purchase": "Ви хочете оформити замовлення?",
    "status": "Ви хочете перевірити статус замовлення?",
    "add": "Ви хочете додати товар до бази даних?",
}


answer_check = {
    "yes": ("так", "правильно", "безумовний", "точний", "абсолютний"),
    "no": ("не", "ні", "неправильно", "відмовитися", "неправильно", "відхилити")
}


functions_dict = {
    "info": functions.get_product_info,
    "purchase": functions.purchase_product,
    "status": functions.get_order_status,
    "add": functions.add_new_product,
}
